HPC motorbike/Large/v1912/AllmeshL
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar 
runParallel snappyHexMesh -overwrite
runApplication reconstructParMesh -constant
runApplication reconstructPar -constant
foamDictionary -entry "pointAndNormalDict.basePoint" -set "( 0 4 0 )" system/mirrorMeshDict
runApplication mirrorMesh -overwrite
mv log.mirrorMesh log.mirrorMesh1
foamDictionary -entry "pointAndNormalDict.basePoint" -set "( 0 12 0 )" system/mirrorMeshDict
runApplication mirrorMesh -overwrite
#optional
#runApplication checkMesh 

#------------------------------------------------------------------------------
